###############################################################################
# Created by write_sdc
# Sat Dec  2 20:51:46 2023
###############################################################################
current_design alphasoc_mem
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clk -period 1100.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clk}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
