###############################################################################
# Created by write_sdc
# Sun Dec  3 10:08:54 2023
###############################################################################
current_design simpleuart
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clk -period 1100.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clk}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
